Revit 2024 API
ExternalServices.BuiltInExternalServices.ExternalResourceService Property
 The external service which permits registration of an alternate servers for managing external resources such as linked files.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ExternalResourceService { get; }
Visual Basic
Public Shared ReadOnly Property ExternalResourceService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ExternalResourceService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace